#ifndef SYSTEMLOGGER_H
#define SYSTEMLOGGER_H

#include <QDebug>
#include <QFile>
#include <QHash>


class systemLogger
{
private:
/** ****************************************************
 * Файл в который будет писаться системный лог
***************************************************** **/
    static QFile* systemLogFile;
/** ****************************************************
 * Был ли инициализирован логгер
***************************************************** **/
    static bool isInit;
/** ****************************************************
 * Тип контекста
***************************************************** **/
    static QHash<QtMsgType, QString> contextNames;

public:
/** ****************************************************
 * Инициализация логгера
***************************************************** **/
    static void init();
/** ****************************************************
 * Очистка логгера
***************************************************** **/
    static void clean();
/** ****************************************************
 * Функция, которая обрабатывает запись лога в логгер
***************************************************** **/
    static void messageOutput(QtMsgType type, const QMessageLogContext& context,
                                const QString& msg);

};

#endif // SYSTEMLOGGER_H
